Revit 2027 API
PreDocEventArgs.Document Property
 The document associated with the event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document Document { get; }
Public ReadOnly Property Document As Document
	Get
public:
property Document^ Document {
	Document^ get ();
}
member Document : Document with get
Property Value
Document
See Also
Reference
PreDocEventArgs Class
Autodesk.Revit.DB.Events Namespace